app/controllers/courses_controller.rb

SELECT * FROM `courses` WHERE (name LIKE '%%') ORDER BY course_number ASC
---
  def index
    @courses = Course.find(:all, :order => "course_number ASC", :conditions => ["name LIKE ?", "%#{params[:search]}%"])

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`name`, `updated_at`, `course_description`, `level`, `course_number`, `created_at`) VALUES('Intro to Digital Imaging', '2009-12-05 02:26:09', '', 'Freshman', '1400', '2009-12-05 02:26:09')
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
UPDATE `courses` SET `course_description` = '', `level` = 'Sophomore', `course_number` = '2400', `updated_at` = '2009-12-05 01:43:00' WHERE `id` = 3
---
  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])