app/controllers/images_controller.rb

SELECT * FROM `images`
---
  def index
     @images = Image.all

SELECT * FROM `works` WHERE (`works`.`id` = 2)
---
   def new
     if params[:work_id]
       @image = Image.new
       @work = Work.find(params[:work_id])

SELECT * FROM `works` WHERE (`works`.`id` = 7)
INSERT INTO "images" ("size", "created_at", "content_type", "thumbnail", "updated_at", "parent_id", "filename", "height", "work_id", "width") VALUES(72896, '2009-12-04 03:13:50', 'image/jpeg', NULL, '2009-12-04 03:13:50', NULL, 'animation20.jpg', NULL, NULL, NULL)
---
   def create
     success_count = file_count = 0
     @work = Work.find(params[:work][:id])

     # Image processing -- atypical validations
     #
     @image = Image.new
     params[:image_data] ||= []
     params[:image_data].each do |file|
       if file != ""
         file_count = file_count + 1
         @image = Image.new({:uploaded_data => file, :work_id => @work.id })
         if @image.save