app/controllers/instructors_controller.rb

  def index
    @instructors = Instructor.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
---
SELECT * FROM "instructors" WHERE (name LIKE '%James Pierce%')