app/controllers/other_files_controller.rb

SELECT * FROM `other_files`
---
  def index
    @other_files = OtherFile.all

SELECT * FROM `works` WHERE (`works`.`id` = 14)
---
  def new
    if params[:work_id]
       @other_file = OtherFile.new
       @work = Work.find(params[:work_id])

SELECT * FROM `works` WHERE (`works`.`id` = 14)
INSERT INTO "other_files" ("content_type", "thumbnail", "size", "updated_at", "filename", "height", "work_id", "parent_id", "width", "created_at") VALUES('application/vnd.openxmlformats-officedocument.wordprocessingml.document', NULL, 42405, '2009-12-07 19:23:06', 'Rails_Rumble_2009_–_Lender_App.docx', NULL, 2, NULL, NULL, '2009-12-07 19:23:06')
---
  def create
    # Based on Image Controller Create

    success_count = file_count = 0
    @work = Work.find(params[:work][:id])

    # Image processing -- atypical validations
    #
    @file = OtherFile.new
    params[:file_data] ||= []
    params[:file_data].each do |file|
      if file != ""
        file_count = file_count + 1
        @file = OtherFile.new({:uploaded_data => file, :work_id => @work.id })
        if @file.save