app/controllers/projects_controller.rb

SELECT * FROM "courses" WHERE ("courses"."name" = 'Introduction to Digital Imaging') LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`name` = '' AND `projects`.`course_id` = 1)
---
  def index
    course = Course.find_by_name(params[:course])
    @projects = Project.find(:all, :conditions => [ "name LIKE ? AND course_id LIKE ?", "%#{params[:search]}%", "#{course.id if course != nil}"])

SELECT * FROM `projects` WHERE (`projects`.`id` = 12)
---
  def edit
    @project = Project.find(params[:id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
UPDATE `projects` SET `description` = 'This is the book binding project.', `updated_at` = '2009-12-06 15:55:02' WHERE `id` = 2
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])