app/controllers/students_controller.rb

SELECT * FROM "students" WHERE ("students"."name" = 'Andrew')
---
  def index
    # @students = Student.all
    #
    # respond_to do |format|
    #   format.html # index.html.erb
    #   format.xml  { render :xml => @students }
    # end

    @students = Student.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def show
    @student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.`id` = 3)
---
  def edit
    @student = Student.find(params[:id])

INSERT INTO "students" ("name", "major_id", "updated_at", "minor_id", "created_at") VALUES('Alex Crawford', NULL, '2009-12-04 05:37:50', NULL, '2009-12-04 05:37:50')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save

SELECT * FROM `students` WHERE (`students`.`id` = 1)
DELETE FROM `students` WHERE `id` = 1
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy