app/controllers/works_controller.rb

  def index
    # @works = Work.all

    @works = Work.paginate( :page => params[:page], :per_page => 50, :order => 'created_at ASC')
---
SELECT * FROM `works` ORDER BY created_at DESC LIMIT 0, 30

  def show
    @work = Work.find(params[:id] )
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)

  def edit
    @work = Work.find(params[:id])
---
SELECT * FROM `works` WHERE (`works`.`id` = 2)

  def create
    # @image = Image.new(params[:image])
    # @work = @image.work = Work.new(params[:work])
    #
    #
    # # ----
    #
    # @image = Image.new
    # params[:image_data] ||= []
    # params[:image_data].each do |file|
    #   @image = Image.new({:uploaded_data => file}) unless file == ""
    # end


    success_count = file_count = 0
    @work = Work.new(params[:work])
    session[:work] = params[:work]

    @work.project.course_id = @work.course.id if @work.course != nil

    respond_to do |format|
      if @work.save
            # Image processing
            #
            @image = Image.new
            params[:image_data] ||= []
            params[:image_data].each do |file|
              if file != ""
                file_count = file_count + 1
                @image = Image.new({:uploaded_data => file, :work_id => @work.id })
                if @image.save
---
INSERT INTO "works" ("name", "instructor_id", "project_id", "updated_at", "semester", "student_id", "description", "created_at") VALUES('Awesomeness', NULL, NULL, '2009-12-04 05:13:32', NULL, NULL, 'Should load both, but does it make the relationship? Probably not.', '2009-12-04 05:13:32')
INSERT INTO `courses` (`name`, `updated_at`, `course_description`, `level`, `course_number`, `credit_hours`, `created_at`) VALUES('Test Course', '2009-12-10 19:00:04', NULL, NULL, NULL, NULL, '2009-12-10 19:00:04')
INSERT INTO `projects` (`name`, `updated_at`, `description`, `course_id`, `created_at`) VALUES('Book Binding', '2009-12-04 21:11:29', NULL, NULL, '2009-12-04 21:11:29')
INSERT INTO "images" ("content_type", "thumbnail", "size", "updated_at", "id", "filename", "height", "work_id", "parent_id", "width", "created_at") VALUES('image/jpeg', NULL, 295378, '2009-12-04 05:17:13', NULL, 'pixolio.jpg', 200, NULL, NULL, 242, '2009-12-04 05:17:13')

              if file != ""
                file_count = file_count + 1
                @file = OtherFile.new({:uploaded_data => file, :work_id => @work.id })
                if @file.save
---
INSERT INTO `other_files` (`content_type`, `thumbnail`, `size`, `updated_at`, `filename`, `height`, `work_id`, `parent_id`, `width`, `created_at`) VALUES('application/pdf', NULL, 902850, '2009-12-08 00:48:37', 'Project_1-print.pdf', NULL, 2, NULL, NULL, '2009-12-08 00:48:37')

  def update
    @work = Work.find(params[:id])

    respond_to do |format|
      if @work.update_attributes(params[:work])
---
SELECT * FROM `works` WHERE (`works`.`id` = 14)
UPDATE `works` SET `updated_at` = '2009-12-07 04:49:43', `project_id` = 14 WHERE `id` = 9

  def destroy
    @work = Work.find(params[:id])
    @work.destroy
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)
DELETE FROM `works` WHERE `id` = 1