app/controllers/works_controller.rb

INSERT INTO "students" ("name", "major_id", "updated_at", "minor_id", "created_at") VALUES('Michael Hix', NULL, '2009-12-04 06:06:30', NULL, '2009-12-04 06:06:30')
---
    def set_student_work(student_ids, work=@work)
      new_record_prefix = '::new_record::'
      student_ids = [student_ids] unless student_ids.is_a? Array
      student_ids = student_ids - [''] - [nil]

      # clear previous
      work.student_works.clear

      unless student_ids.blank?
        # reassign students
        student_ids.each do |id|
          if id.to_s.start_with?(new_record_prefix) && id.to_s.gsub(new_record_prefix, '') != ''
            student = Student.create(name: id.to_s.gsub(new_record_prefix, ''))